Revit 2027 API
BuiltInFailures.StairRampFailures.CannotGenerateFaces Property
 Couldn't generate surfaces for stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotGenerateFaces { get; }
Public Shared ReadOnly Property CannotGenerateFaces As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotGenerateFaces {
	FailureDefinitionId^ get ();
}
static member CannotGenerateFaces : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace